### creating structured data

In [12]:
df={
    'index':[0,1,2],
    'cols':[
        { 'name':'growth',
          'data':[.5,.7,1.2] },
        { 'name':'Name',
          'data': ['Paul','George','Ringo']},
    ]
}

In [13]:
def get_row(df, idx):
    results = []
    value_idx = df['index'].index(idx)
    for col in df['cols']:
        results.append(col['data'][value_idx])
    return results

In [14]:
def get_col(df, name):
    for col in df['cols']:
        if col['name'] == name:
            return col['data']

In [15]:
get_row(df,1)

[0.7, 'George']

In [16]:
get_col(df,'growth')

[0.5, 0.7, 1.2]

# DataFrames

In [17]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt

In [7]:
df=pd.DataFrame({
    'growth':[.5,.7,1.2],
    'Name':["A","B","C"]
})

In [8]:
df

   growth Name
0     0.5    A
1     0.7    B
2     1.2    C

In [9]:
df.iloc[2]

growth    1.2
Name        C
Name: 2, dtype: object

In [10]:
df["Name"]

0    A
1    B
2    C
Name: Name, dtype: object

In [11]:
df["name"]

KeyError: 'name'

In [ ]:
type(df["Name"])

In [ ]:
df["Name"].str.lower()

In [ ]:
pd.DataFrame([{'growth':.5, 'Name':'Paul'},
{'growth':.7, 'Name':'George'},
{'growth':1.2, 'Name':'Ringo'}])

In [ ]:
import io
csv_file = io.StringIO("""growth,Name
 .5,Paul
 .7,George
 1.2,Ringo""")
csv_file

In [ ]:
pd.read_csv(csv_file)

In [ ]:
np.random.seed(123)
pd.DataFrame(np.random.randn(10,3),columns=['a','b', 'c'])

In [ ]:
pd.DataFrame(np.random.randn(10,3),columns=['a','b', 'c'])

In [ ]:
df.axes

In [ ]:
df.axes[0]

In [ ]:
df.axes[1]

In [ ]:
df.apply(np.sum,axis=0)

In [ ]:
df.apply(np.sum,axis=1)

In [ ]:
 data = io.StringIO('''LOCATION,MILES,ELEVATION,CUMUL,% CUMUL GAIN
... Big Mountain Pass Aid Station,39.07,7432,11579,43.8%
... Mules Ear Meadow,40.75,7478,12008,45.4%
... Bald Mountain,42.46,7869,12593,47.6%
... Pence Point,43.99,7521,12813,48.4%
... Alexander Ridge Aid Station,46.9,6160,13169,49.8%
... Alexander Springs,47.97,5956,13319,50.3%
... Rogers Trail junction,49.52,6698,13967,52.8%
... Rogers Saddle,49.77,6790,14073,53.2%
... Railroad Bed,50.15,6520,,
... Lambs Canyon Underpass Aid Station,52.48,6111,14329,54.2%''')

In [ ]:
df = pd.read_csv(data)
df

In [ ]:
df.describe()

In [ ]:
df.describe(percentiles=[.1,.2,.3,.4])

In [ ]:
df['LOCATION']

In [ ]:
df['LOCATION'].value_counts()

In [ ]:
df.corr()

### Plotting With Data Frames

In [ ]:
fig=plt.figure()
df.plot()

In [ ]:
fig=plt.figure()
df.plot(ax=fig.add_subplot(111))

In [ ]:
 fig = plt.figure()
 ax = fig.add_subplot(111)
 df[['CUMUL', 'ELEVATION']].plot(ax=ax)
 df['MILES'].plot(secondary_y=True)
 plt.legend(loc='best')
 ax.set_ylabel('Elevation (feet)')
 ax.right_ax.set_ylabel('Distance (miles)')

### Adding rows

In [ ]:
df2=pd.DataFrame([('Lamba Trail',54.14,6628,14805,"56.0%"),("Patna",55.64,6142,15840,"53.86")],
                 columns=["LOCATION","MILES","ELEVATION","CUMUL","% CUMUL GAIN"])

df2

In [ ]:
print(pd.concat([df,df2]))

In [ ]:
df3=pd.DataFrame([('Lamba Trail',54.14,6628,14805,"56.0%"),("Patna",55.64,6142,15840,"53.86")])
print(pd.concat([df,df3]))

In [ ]:
df=pd.concat([df,df2],ignore_index=True)
df

In [ ]:
print(df.index)

In [ ]:
df["bogus"]=pd.Series(range(12))

In [ ]:
df

In [ ]:
def aid_station(val):
    return "Station" in val

In [ ]:
df["STATION"]=df["LOCATION"].apply(aid_station)
df

In [ ]:
df.drop([5,9])

In [ ]:
df.drop(df.index[5:10:4])

In [ ]:
bogous=df.pop("bogus")

In [ ]:
bogous

In [ ]:
df.columns

In [ ]:
df["bogus"]=bogous

In [ ]:
del df["bogus"]

In [ ]:
df.columns

In [ ]:
df.drop(['ELEVATION', 'CUMUL', '% CUMUL GAIN', 'STATION'],axis=1)

# DataFrame methods

In [ ]:
data =io. StringIO('''UPC,Units,Sales,Date
... 1234,5,20.2,1-1-2014
... 1234,2,8.,1-2-2014
... 1234,3,13.,1-3-2014
... 789,1,2.,1-1-2014
... 789,2,3.8,1-2-2014
... 789,,,1-3-2014
... 789,1,1.8,1-5-2014''')

In [ ]:
sales=pd.read_csv(data)

In [ ]:
sales

In [ ]:
sales.axes

In [ ]:
sales.index

In [ ]:
sales.columns

In [ ]:
sales.shape

In [ ]:
sales.info()

In [ ]:
for i in sales:
    print(i)

In [ ]:
for i in sales.keys():
    print(i)

In [ ]:
for col,ser in sales.iteritems():
    print(col,ser)

In [ ]:
for row in sales.iterrows():
    print(row)

In [ ]:
for row in sales.itertuples():
    print(row)
    break

In [ ]:
#namedtuple
import collections
Sales = collections.namedtuple('Sales','upc,units,sales')
s = Sales(1234, 5., 20.2)
s[0] # index access

In [ ]:
len(sales)

In [ ]:
sales +10

In [ ]:
sales

In [ ]:
sales[["Sales","Units"]]+10

In [ ]:
sales.Units+2

In [ ]:
sales.transpose()

In [ ]:
sales.dot(sales.T)

In [ ]:
fout=io.StringIO()

In [ ]:
sales.to_csv(fout,index_label="index")

In [ ]:
print(fout.getvalue())

In [ ]:
sales.to_dict()

In [ ]:
pd.DataFrame({'UPC': {0: 1234, 1: 1234, 2: 1234, 3: 789, 4: 789, 5: 789, 6: 789},
 'Units': {0: 5.0, 1: 2.0, 2: 3.0, 3: 1.0, 4: 2.0, 5: None,},
 'Sales': {0: 20.2, 1: 8.0, 2: 13.0, 3: 2.0, 4: 3.8, 5: None, 6: 1.8},
 'Date': {0: '1-1-2014',
  1: '1-2-2014',
  2: '1-3-2014',
  3: '1-1-2014',
  4: '1-2-2014',
  5: '1-3-2014',
  6: '1-5-2014'}})

In [ ]:
sales.to_dict(orient="list")

In [ ]:
writer=pd.ExcelWriter("otput.xlsx")

In [ ]:
sales.to_excel(writer,"sheet1")
writer.save()

In [ ]:
pd.read_excel("otput.xlsx")

In [ ]:
sales.values

In [ ]:
sales.reindex([0,4])

In [ ]:
sales.reindex(columns=["Date","Sales"])

In [ ]:
sales.reindex(index=[2, 6, 8],
columns=['Sales', 'UPC', 'missing'])

In [ ]:
by_date = sales.set_index('Date')
by_date

In [ ]:
by_date.reset_index()

In [ ]:
sales

In [ ]:
sales.iat[4,3]

In [ ]:
by_date._get_value('1-5-2014', 'UPC')

In [ ]:
by_date._get_value("1-2-2014","UPC")

In [ ]:
sales._set_value(6,"Sales",789)
sales

In [ ]:
sales.insert(1,"Category","Food")

In [ ]:
sales

In [ ]:
sales.replace(789,790)

In [ ]:
sales.replace({"UPC":{789:790},
              "Sales":{789:1.4}
              })

In [ ]:
sales.replace('(F.*d)', r'\1_stuff', regex=True)

### deleting column

In [ ]:
sales.drop(["Category","Units"],axis=1)

### slicing

In [ ]:
sales.head()

In [ ]:
sales.tail(3)

In [ ]:
sales["new_index"]=list("abcdefg")
sales

In [ ]:
df=sales.set_index("new_index")
df

In [ ]:
sales

In [ ]:
del sales["new_index"]

In [ ]:
sales

In [ ]:
df.iloc[2:4]

In [ ]:
df.iloc[2:4,-3:-1]

In [ ]:
df.loc["a":"d"]

In [ ]:
df.loc["a":"d","Units": "Date"]

In [ ]:
df.loc[:,['UPC', 'Sales']].iloc[-4:]

In [ ]:
df.ix[-4:, ['UPC', 'Sales']]

### Sorting

In [ ]:
sales

In [ ]:
sales.sort_values("UPC")

In [ ]:
sales.sort

In [ ]:
sales.sort_values(["Units","UPC"])

In [ ]:
sales.sort_index(ascending=False)

### Data Frame Statistics

In [ ]:
data = '''year\tinches\tlocation
... 2006\t633.5\tutah
... 2007\t356\tutah
... 2008\t654\tutah
... 2009\t578\tutah
... 2010\t430\tutah
... 2011\t553\tutah
... 2012\t329.5\tutah
... 2013\t382.5\tutah
... 2014\t357.5\tutah
... 2015\t267.5\tutah
... 2016\tnan\tNone'''

In [ ]:
snow = pd.read_table(io.StringIO(data))
snow

In [ ]:
snow.describe()

In [ ]:
snow.describe(include="all")

In [ ]:
snow.quantile()

In [ ]:
snow.quantile(q=[.1,.9])

In [ ]:
snow.count()

In [ ]:
snow.any()

In [ ]:
snow.any(axis=1)

In [ ]:
snow.all()

In [ ]:
snow.all(axis=1)

In [ ]:
snow.rank()

In [ ]:
snow.rank(method='max')

In [ ]:
snow

In [ ]:
snow["inches"].clip(lower=400,upper=600)

In [ ]:
snow

In [ ]:
snow["inches"]=(snow["inches"].clip(lower=400,upper=600))

In [ ]:
snow

In [ ]:
snow.corr()

In [ ]:
snow.corr(method='spearman')

In [ ]:
snow2 = snow[['inches']] - 100
snow.corrwith(snow2)

In [ ]:
snow.cov()

In [ ]:
snow.sum()

In [ ]:
snow["inches"].sum()

In [ ]:
snow.sum(numeric_only=True)

In [ ]:
snow.prod()

In [ ]:
snow.mean()

In [ ]:
snow.mean(axis=1)

In [ ]:
snow.var()

In [ ]:
snow.mad()

In [ ]:
snow.skew()

In [ ]:
 snow.kurt()

In [ ]:
snow[['year', 'inches']].idxmax()

In [ ]:
snow[['year', 'inches']].max()

### Grouping, Pivoting, and Reshaping

In [ ]:
scores=pd.DataFrame({
    'name':['Adam', 'Bob', 'Dave', 'Fred'],
    'age': [15, 16, 16, 15],
    'test1': [95, 81, 89, None],
    'test2': [80, 82, 84, 88],
    'teacher': ['Ashby', 'Ashby', 'Jones', 'Jones']
})

In [ ]:
scores

In [ ]:
scores.groupby('teacher').median()

In [ ]:
scores.groupby('teacher').median()[["test1","test2"]]

In [ ]:
scores.groupby(["teacher",'age']).median()

In [ ]:
scores.groupby(['teacher','age']).agg([min,max])

In [ ]:
scores.pivot_table(index='teacher',
                  values=['test1','test2']
                  , aggfunc='median')

In [ ]:
scores.pivot_table(index=['teacher','age'],
                  values=['test1','test2']
                  , aggfunc='median')

In [ ]:
scores.pivot_table(index=['teacher','age'],
                  values=['test1','test2']
                  , aggfunc=['median',max,min])

In [ ]:
scores.pivot_table(index=['teacher','age'],
                  values=['test1','test2']
                  , aggfunc=['median',max,min]
                  ,margins=True)

In [ ]:
scores

In [ ]:
pd.melt(scores,id_vars=['name','age'],value_vars=['test1','test2'])

In [ ]:
pd.melt(scores,id_vars=['name','age'],value_vars=['test1','test2'],var_name='test',value_name='score')

In [ ]:
pd.melt(scores,value_vars=['test1','test2'],var_name='test',value_name='score')

In [ ]:
long_df=pd.melt(scores,id_vars=['name','age'],value_vars=['test1','test2'],var_name='test',value_name='score')

In [ ]:
long_df

In [ ]:
wide_df=long_df.pivot_table(index=['name','age'],
                           columns='test',values=['score'])

In [ ]:
wide_df

In [ ]:
wide_df=wide_df.reset_index()

In [ ]:
wide_df

In [ ]:
cols = wide_df.columns
cols.get_level_values(0)

In [ ]:
cols.get_level_values(1)

In [ ]:
l1=cols.get_level_values(1)
l0=cols.get_level_values(0)

In [ ]:
l1

In [ ]:
l0

In [ ]:
names=[x[1] if x[1] else x[0] for x in zip(l0,l1)]
names

In [ ]:
wide_df.columns=names

In [ ]:
wide_df

In [ ]:
pd.get_dummies(scores, columns=['age','name'],prefix=['age',"name"])

In [ ]:
def undummy(df, prefix, new_col_name, val_type=float):
    """ df - dataframe with dummy columns
prefix - prefix of dummy columns
new_col_name - column name to replace dummy columns
... val_type - callable type for new column
... '''"""
    dummy_cols = [col for col in df.columns
                if col.startswith(prefix)]
# map of index location of dummy variable to new value
    idx2val = {i:val_type(col[len(prefix):]) for i, col in enumerate(dummy_cols)}

    def get_index(vals): # idx of dummy col to use

        return list(vals).index(1)
 # using the dummy_cols lookup the new value by idx

    ser = df[dummy_cols].apply(lambda x: idx2val.get(get_index(x), None), axis=1)
    df[new_col_name] = ser
    df = df.drop(dummy_cols, axis=1)
    return df

In [ ]:
dum = pd.get_dummies(scores, columns=['age'], prefix='age')
dum

In [ ]:
undummy(dum, 'age_', 'age')

# Dealing With Missing Data

In [20]:
import io
data="""Name|Age|Color
Fred|22|Red
Sally|29|Blue
Sam|24|
Fido||Black
"""

In [24]:
df=pd.read_table(io.StringIO(data),sep="|")

In [25]:
df

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0    NaN
3   Fido   NaN  Black

In [26]:
df.isnull()

    Name    Age  Color
0  False  False  False
1  False  False  False
2  False  False   True
3  False   True  False

In [30]:
df.isnull().any()

Name     False
Age       True
Color     True
dtype: bool

In [31]:
df.dropna()

    Name   Age Color
0   Fred  22.0   Red
1  Sally  29.0  Blue

In [32]:
df

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0    NaN
3   Fido   NaN  Black

In [33]:
df.notnull()

   Name    Age  Color
0  True   True   True
1  True   True   True
2  True   True  False
3  True  False   True

In [34]:
valid=df.notnull()
df[valid.Age]

    Name   Age Color
0   Fred  22.0   Red
1  Sally  29.0  Blue
2    Sam  24.0   NaN

In [35]:
df[valid.Color]

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
3   Fido   NaN  Black

In [37]:
mask=valid.Age & valid.Color

In [38]:
mask

0     True
1     True
2    False
3    False
dtype: bool

In [39]:
df[mask]

    Name   Age Color
0   Fred  22.0   Red
1  Sally  29.0  Blue

In [40]:
mask = valid[['Age', 'Color']].apply(all, axis=1)

In [41]:
df[mask]

    Name   Age Color
0   Fred  22.0   Red
1  Sally  29.0  Blue

In [42]:
df

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0    NaN
3   Fido   NaN  Black

In [43]:
df.fillna("missing")

    Name      Age    Color
0   Fred     22.0      Red
1  Sally     29.0     Blue
2    Sam     24.0  missing
3   Fido  missing    Black

In [45]:
df.fillna({'Age':df.Age.median(),
          'Color':'Pink'})

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0   Pink
3   Fido  24.0  Black

In [46]:
df

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0    NaN
3   Fido   NaN  Black

In [47]:
df.fillna(method='bfill')

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0  Black
3   Fido   NaN  Black

In [48]:
df.fillna(method='ffill')

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0   Blue
3   Fido  24.0  Black

In [49]:
df.fillna(method='ffill',axis=1)

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0   24.0
3   Fido  Fido  Black

In [50]:
df.interpolate()

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0    NaN
3   Fido  24.0  Black

In [52]:
df.replace(np.nan,value=-1)

    Name   Age  Color
0   Fred  22.0    Red
1  Sally  29.0   Blue
2    Sam  24.0     -1
3   Fido  -1.0  Black

# Joining Data Frames

In [89]:
df1 = pd.DataFrame({'name': ['John', 'George', 'Ringo'],
'color': ['Blue', 'Blue', 'Purple']})
df2 = pd.DataFrame({'name': ['Paul', 'George', 'Ringo'],
'carcolor': ['Red', 'Blue', np.nan]},
index=[3, 1, 2])

In [54]:
df1

     name   color
0    John    Blue
1  George    Blue
2   Ringo  Purple

In [55]:
df2

     name carcolor
3    Paul      Red
1  George     Blue
2   Ringo      NaN

In [56]:
pd.concat([df1,df2])

     name   color carcolor
0    John    Blue      NaN
1  George    Blue      NaN
2   Ringo  Purple      NaN
3    Paul     NaN      Red
1  George     NaN     Blue
2   Ringo     NaN      NaN

In [57]:
pd.concat([df1, df2], verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([1, 2], dtype='int64')

In [58]:
pd.concat([df1, df2], ignore_index=True)

     name   color carcolor
0    John    Blue      NaN
1  George    Blue      NaN
2   Ringo  Purple      NaN
3    Paul     NaN      Red
4  George     NaN     Blue
5   Ringo     NaN      NaN

In [81]:
df3 = pd.DataFrame({'name': ['John', 'George', 'Ringo'],
'color': ['Blue', 'Blue', 'Purple']})
df4 = pd.DataFrame({'name': ['Paul', 'George', 'Ringo'],
'carcolor': ['Red', 'Blue', np.nan]},
index=['I', 'J', 'K'])

In [82]:
df3

     name   color
0    John    Blue
1  George    Blue
2   Ringo  Purple

##

In [83]:
df4

     name carcolor
I    Paul      Red
J  George     Blue
K   Ringo      NaN

In [84]:
pd.concat([df3, df4], ignore_index=True)

     name   color carcolor
0    John    Blue      NaN
1  George    Blue      NaN
2   Ringo  Purple      NaN
3    Paul     NaN      Red
4  George     NaN     Blue
5   Ringo     NaN      NaN

In [86]:
df5 = pd.DataFrame({'name': ['John', 'George', 'Ringo'],
'color': ['Blue', 'Blue', 'Purple']},
                  index=['A', 'B', 'C'])
df6 = pd.DataFrame({'name': ['Paul', 'George', 'Ringo'],
'carcolor': ['Red', 'Blue', np.nan]},
index=['I', 'J', 'K'])

mnds

In [87]:
pd.concat([df5, df6], ignore_index=True)

     name   color carcolor
0    John    Blue      NaN
1  George    Blue      NaN
2   Ringo  Purple      NaN
3    Paul     NaN      Red
4  George     NaN     Blue
5   Ringo     NaN      NaN

In [91]:
pd.concat([df1,df2],axis=1)

     name   color    name carcolor
0    John    Blue     NaN      NaN
1  George    Blue  George     Blue
2   Ringo  Purple   Ringo      NaN
3     NaN     NaN    Paul      Red

###  Joins

In [92]:
df1.set_index('name').join(df2.set_index('name'))

         color carcolor
name
John      Blue      NaN
George    Blue     Blue
Ringo   Purple      NaN

In [93]:
df1.set_index('name')

         color
name
John      Blue
George    Blue
Ringo   Purple

In [94]:
df1.merge(df2)

     name   color carcolor
0  George    Blue     Blue
1   Ringo  Purple      NaN

In [98]:
df1.merge(df2,how='inner')

     name   color carcolor
0  George    Blue     Blue
1   Ringo  Purple      NaN

In [99]:
df1.merge(df2,how='outer')

     name   color carcolor
0    John    Blue      NaN
1  George    Blue     Blue
2   Ringo  Purple      NaN
3    Paul     NaN      Red

In [100]:
df1.merge(df2,how='left')

     name   color carcolor
0    John    Blue      NaN
1  George    Blue     Blue
2   Ringo  Purple      NaN

In [101]:
df1.merge(df2,how='right')

     name   color carcolor
0    Paul     NaN      Red
1  George    Blue     Blue
2   Ringo  Purple      NaN

In [102]:
df2.merge(df1,how='right')

     name carcolor   color
0    John      NaN    Blue
1  George     Blue    Blue
2   Ringo      NaN  Purple

In [108]:
df2.merge(df1,on=df1.index)

   key_0  name_x carcolor  name_y   color
0      0    Paul      Red    John    Blue
1      1  George     Blue  George    Blue
2      2   Ringo      NaN   Ringo  Purple

In [109]:
df1

     name   color
0    John    Blue
1  George    Blue
2   Ringo  Purple

In [110]:
df2

     name carcolor
3    Paul      Red
1  George     Blue
2   Ringo      NaN

In [115]:
df2.merge(df1,left_on='carcolor',right_on='color')

   name_x carcolor  name_y color
0  George     Blue    John  Blue
1  George     Blue  George  Blue

In [ ]:
df2.merge(df1,on=df1.index)